; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	thermograph2 - mode
	infrared0 - mode
	image3 - mode
	image1 - mode
	thermograph4 - mode
	Star2 - direction
	GroundStation1 - direction
	GroundStation5 - direction
	Star4 - direction
	GroundStation0 - direction
	Star3 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Star8 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 Star2)
	(supports instrument2 thermograph2)
	(supports instrument2 thermograph4)
	(calibration_target instrument2 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
	(supports instrument3 infrared0)
	(supports instrument3 image1)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 Star2)
	(supports instrument4 image1)
	(calibration_target instrument4 Star3)
	(calibration_target instrument4 Star4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star11)
	(supports instrument5 thermograph4)
	(supports instrument5 image3)
	(calibration_target instrument5 GroundStation0)
	(calibration_target instrument5 Star3)
	(supports instrument6 image3)
	(supports instrument6 infrared0)
	(supports instrument6 thermograph4)
	(calibration_target instrument6 GroundStation1)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet10)
	(supports instrument7 thermograph2)
	(supports instrument7 image3)
	(supports instrument7 image1)
	(calibration_target instrument7 Star3)
	(calibration_target instrument7 GroundStation5)
	(supports instrument8 image3)
	(supports instrument8 thermograph2)
	(calibration_target instrument8 GroundStation0)
	(calibration_target instrument8 Star3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star11)
	(supports instrument9 thermograph2)
	(supports instrument9 image1)
	(calibration_target instrument9 Star4)
	(calibration_target instrument9 GroundStation5)
	(supports instrument10 thermograph4)
	(supports instrument10 infrared0)
	(calibration_target instrument10 GroundStation0)
	(supports instrument11 thermograph2)
	(supports instrument11 thermograph4)
	(calibration_target instrument11 Star3)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star11)
)
(:goal (and
	(pointing satellite0 GroundStation0)
	(pointing satellite4 Star8)
	(have_image Phenomenon6 infrared0)
	(have_image Planet7 thermograph2)
	(have_image Star8 thermograph4)
	(have_image Planet9 image1)
	(have_image Planet10 image1)
	(have_image Star11 image1)
	(have_image Phenomenon12 image3)
	(have_image Planet13 thermograph4)
))

)

; plan
1. (turn_to satellite4 groundstation0 star11)
   deleted: (pointing satellite4 star11)
   added: (pointing satellite4 groundstation0)
   goals met: 1 of 10
2. (turn_to satellite3 groundstation5 star11)
   deleted: (pointing satellite3 star11)
   added: (pointing satellite3 groundstation5)
   goals met: 1 of 10
3. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 1 of 10
4. (calibrate satellite3 instrument7 groundstation5)
   added: (calibrated instrument7)
   goals met: 1 of 10
5. (turn_to satellite3 planet9 groundstation5)
   deleted: (pointing satellite3 groundstation5)
   added: (pointing satellite3 planet9)
   goals met: 1 of 10
6. (take_image satellite3 planet9 instrument7 image1)
   added: (have_image planet9 image1)
   goals met: 2 of 10
7. (turn_to satellite3 planet7 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 planet7)
   goals met: 2 of 10
8. (take_image satellite3 planet7 instrument7 thermograph2)
   added: (have_image planet7 thermograph2)
   goals met: 3 of 10
9. (turn_to satellite3 planet10 planet7)
   deleted: (pointing satellite3 planet7)
   added: (pointing satellite3 planet10)
   goals met: 3 of 10
10. (take_image satellite3 planet10 instrument7 image1)
   added: (have_image planet10 image1)
   goals met: 4 of 10
11. (turn_to satellite3 phenomenon12 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 phenomenon12)
   goals met: 4 of 10
12. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 4 of 10
13. (calibrate satellite4 instrument10 groundstation0)
   added: (calibrated instrument10)
   goals met: 4 of 10
14. (take_image satellite3 phenomenon12 instrument7 image3)
   added: (have_image phenomenon12 image3)
   goals met: 5 of 10
15. (turn_to satellite3 star11 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 star11)
   goals met: 5 of 10
16. (take_image satellite3 star11 instrument7 image1)
   added: (have_image star11 image1)
   goals met: 6 of 10
17. (turn_to satellite4 phenomenon6 groundstation0)
   deleted: (pointing satellite4 groundstation0)
   added: (pointing satellite4 phenomenon6)
   goals met: 6 of 10
18. (take_image satellite4 phenomenon6 instrument10 infrared0)
   added: (have_image phenomenon6 infrared0)
   goals met: 7 of 10
19. (turn_to satellite4 planet13 phenomenon6)
   deleted: (pointing satellite4 phenomenon6)
   added: (pointing satellite4 planet13)
   goals met: 7 of 10
20. (take_image satellite4 planet13 instrument10 thermograph4)
   added: (have_image planet13 thermograph4)
   goals met: 8 of 10
21. (turn_to satellite4 star8 planet13)
   deleted: (pointing satellite4 planet13)
   added: (pointing satellite4 star8)
   goals met: 9 of 10
22. (take_image satellite4 star8 instrument10 thermograph4)
   added: (have_image star8 thermograph4)
   goals met: 10 of 10
